In [1]:
import pandas as pd

data = {
    'Name' : ['Ayush', 'Ayan', 'Shohini', 'Akash','Ipsita'],
    'Age' : [21,None,20,21,None],
    'Salary' :[100000,70000,90000,None,None]
}

df = pd.DataFrame(data)
print(df)

      Name   Age    Salary
0    Ayush  21.0  100000.0
1     Ayan   NaN   70000.0
2  Shohini  20.0   90000.0
3    Akash  21.0       NaN
4   Ipsita   NaN       NaN

In [2]:
# df.isnull().sum()
print(df.isnull().mean()*100)

Name       0.0
Age       40.0
Salary    40.0
dtype: float64

In [3]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Salary'].fillna(df['Salary'].mean(),inplace=True)
print(df)

      Name        Age         Salary
0    Ayush  21.000000  100000.000000
1     Ayan  20.666667   70000.000000
2  Shohini  20.000000   90000.000000
3    Akash  21.000000   86666.666667
4   Ipsita  20.666667   86666.666667

In [4]:
df.dropna()

      Name        Age         Salary
0    Ayush  21.000000  100000.000000
1     Ayan  20.666667   70000.000000
2  Shohini  20.000000   90000.000000
3    Akash  21.000000   86666.666667
4   Ipsita  20.666667   86666.666667